Add ingress to main.tf

```hcl
# IP pública estática para el Service LoadBalancer del ingress-nginx
resource "azurerm_public_ip" "ingress" {
  name                = "aks-game-ingress-ip"
  location            = data.azurerm_kubernetes_cluster.aks.location
  resource_group_name = data.azurerm_kubernetes_cluster.aks.node_resource_group
  allocation_method   = "Static"
  sku                 = "Standard"
}
```
Attaching my terraform plan

```hcl
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_public_ip.ingress will be created
  + resource "azurerm_public_ip" "ingress" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "aks-game-ingress-ip"
      + resource_group_name     = "MC_aks-test_aks-mlops-demo_eastus"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
...